{
  "app": {
    "name": "Holiday Schedules",
    "short_description": "Import Holidays from your Google Calender to Holidays in Zendesk Schedules",
    "long_description": "Managing your holidays in Zendesk is useful for auto-response and KPI measurement.\nThis app assist to register Holidays from your Google Calender to Holidays in Zendesk Schedules automatically.\n- Easy to use\n- Integrates with Google Calender\nI make it easy to configure Holiday Schedules to your Zendesk account.\n",
    "installation_instructions": "First, Activate the Google Calender API in your Google Developer Console.\n0. Log in to your Google account with your browser before you configure this app.\n1. Create a Google App Project with the Google Calender API enabled at [Google Calendar API](https://console.developers.google.com/henhouse/?pb=%5B%22hh-0%22%2C%22calendar%22%2Cnull%2C%5B%5D%2C%22https%3A%2F%2Fdevelopers.google.com%22%2Cnull%2C%5B%5D%2Cnull%2C%22Enable%20the%20Google%20Calendar%20API%22%2C1%2Cnull%2C%5B%5D%2Cfalse%2Cfalse%2Cnull%2Cnull%2Cnull%2Cnull%2Cfalse%2Cnull%2Cfalse%2Cfalse%2Cnull%2Cnull%2Cnull%2C%22WEB_BROWSER%22%2C%22http%3A%2F%2Flocalhost%3A8000%22%2C%22Quickstart%22%2Ctrue%2C%22Quickstart%22%2Cnull%2Cnull%2Cfalse%5D&amp;authuser=1).\n2. Set an arbitrary project name.\n3. Copy the Client ID. Use it to set up this app.\n4. Access Google's [Developer Console](https://console.cloud.google.com/apis/credentials) and select the project you created above.\n5. Select Create Credentials from Credentials and create an API key.\n6. Save the created API key. This is also used in this app.\n7. Enable the created API key to be used only by Google Calender API.\n8. Now you are ready to configure the app. You have one more step after installation, so let's bring up the configuration screen for the ID you just created in OAuth 2.0 Client ID in the Google Developer Console. You need to set the 'approved source of JavaScript generation' setting after the app is launched.\n9. set the Client ID and API key you saved during installation. When the first time you start the app, you will see the following message.\n'Not a valid origin for the client: https://xxxxx.apps.zdusercontent.com has not been whitelisted for client ID xxxxxx-xxxxx.apps. Please go to https://console.developers.google.com/ and whitelist this origin for your project's client ID.'\n10. Once you have completed your settings and refreshed your browser, the message will disappear (it may take a while). Then press the Autherize button and specify the calendar account you want to import in Google SSO.\n11. you may see a Google Warning, but ignore it and go to zdusercontent.com (unsafe) to grant permission to load Google Calender.\n12. After authentication, you can see the list of Schedules in Zendesk and the list of holidays you have added in the other calendars in Google Calender, set the calendars you want to import and the calendars you want to import, and click Import.\n13. Confirm that the holiday has been added to Schedules.\nYou can see the instructions with images at https://github.com/toru-takahashi/zendesk-holiday-schedules",
    "parameters": {
      "google_oauth_client_id": {
        "label": "Your OAuth2 Google Client ID"
      },
      "google_oauth_api": {
        "label": "Your OAuth2 Google API KEY"
      }
    }
  }
}
